Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/fcw.h
#define FCW_INTFLAG_DONE_Pos                  _UINT32_(0)                                          /* (FCW_INTFLAG) NVM Operation Done Flag Bit Position */
#define FCW_INTFLAG_DONE_Msk                  (_UINT32_(0x1) << FCW_INTFLAG_DONE_Pos)              /* (FCW_INTFLAG) NVM Operation Done Flag Bit Mask */
#define FCW_INTFLAG_DONE(value)               (FCW_INTFLAG_DONE_Msk & (_UINT32_(value) << FCW_INTFLAG_DONE_Pos)) /* Assigment of value for DONE in the FCW_INTFLAG register */
#define FCW_INTFLAG_KEYERR_Pos                _UINT32_(1)                                          /* (FCW_INTFLAG) Key Error Flag Bit Position */
#define FCW_INTFLAG_KEYERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_KEYERR_Pos)            /* (FCW_INTFLAG) Key Error Flag Bit Mask */
#define FCW_INTFLAG_KEYERR(value)             (FCW_INTFLAG_KEYERR_Msk & (_UINT32_(value) << FCW_INTFLAG_KEYERR_Pos)) /* Assigment of value for KEYERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_CFGERR_Pos                _UINT32_(2)                                          /* (FCW_INTFLAG) Configuration Error Flag Bit Position */
#define FCW_INTFLAG_CFGERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_CFGERR_Pos)            /* (FCW_INTFLAG) Configuration Error Flag Bit Mask */
#define FCW_INTFLAG_CFGERR(value)             (FCW_INTFLAG_CFGERR_Msk & (_UINT32_(value) << FCW_INTFLAG_CFGERR_Pos)) /* Assigment of value for CFGERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_FIFOERR_Pos               _UINT32_(3)                                          /* (FCW_INTFLAG) FIFO Underrun during Row Write Flag Bit Position */
#define FCW_INTFLAG_FIFOERR_Msk               (_UINT32_(0x1) << FCW_INTFLAG_FIFOERR_Pos)           /* (FCW_INTFLAG) FIFO Underrun during Row Write Flag Bit Mask */
#define FCW_INTFLAG_FIFOERR(value)            (FCW_INTFLAG_FIFOERR_Msk & (_UINT32_(value) << FCW_INTFLAG_FIFOERR_Pos)) /* Assigment of value for FIFOERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_BUSERR_Pos                _UINT32_(4)                                          /* (FCW_INTFLAG) AHB Bus Error during Row Write Flag Bit Position */
#define FCW_INTFLAG_BUSERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_BUSERR_Pos)            /* (FCW_INTFLAG) AHB Bus Error during Row Write Flag Bit Mask */
#define FCW_INTFLAG_BUSERR(value)             (FCW_INTFLAG_BUSERR_Msk & (_UINT32_(value) << FCW_INTFLAG_BUSERR_Pos)) /* Assigment of value for BUSERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_WPERR_Pos                 _UINT32_(5)                                          /* (FCW_INTFLAG) Write Protection Error Flag Bit Position */
#define FCW_INTFLAG_WPERR_Msk                 (_UINT32_(0x1) << FCW_INTFLAG_WPERR_Pos)             /* (FCW_INTFLAG) Write Protection Error Flag Bit Mask */
#define FCW_INTFLAG_WPERR(value)              (FCW_INTFLAG_WPERR_Msk & (_UINT32_(value) << FCW_INTFLAG_WPERR_Pos)) /* Assigment of value for WPERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_OPERR_Pos                 _UINT32_(6)                                          /* (FCW_INTFLAG) NVMOP Error Flag Bit Position */
#define FCW_INTFLAG_OPERR_Msk                 (_UINT32_(0x1) << FCW_INTFLAG_OPERR_Pos)             /* (FCW_INTFLAG) NVMOP Error Flag Bit Mask */
#define FCW_INTFLAG_OPERR(value)              (FCW_INTFLAG_OPERR_Msk & (_UINT32_(value) << FCW_INTFLAG_OPERR_Pos)) /* Assigment of value for OPERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_SECERR_Pos                _UINT32_(7)                                          /* (FCW_INTFLAG) Security Violation Error Bit Position */
#define FCW_INTFLAG_SECERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_SECERR_Pos)            /* (FCW_INTFLAG) Security Violation Error Bit Mask */
#define FCW_INTFLAG_SECERR(value)             (FCW_INTFLAG_SECERR_Msk & (_UINT32_(value) << FCW_INTFLAG_SECERR_Pos)) /* Assigment of value for SECERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_HTDPGM_Pos                _UINT32_(8)                                          /* (FCW_INTFLAG) High Temperature Detect Error Flag Bit Position */
#define FCW_INTFLAG_HTDPGM_Msk                (_UINT32_(0x1) << FCW_INTFLAG_HTDPGM_Pos)            /* (FCW_INTFLAG) High Temperature Detect Error Flag Bit Mask */
#define FCW_INTFLAG_HTDPGM(value)             (FCW_INTFLAG_HTDPGM_Msk & (_UINT32_(value) << FCW_INTFLAG_HTDPGM_Pos)) /* Assigment of value for HTDPGM in the FCW_INTFLAG register */
#define FCW_INTFLAG_BORERR_Pos                _UINT32_(12)                                         /* (FCW_INTFLAG) Brown Out Detect Error Flag Bit Position */
#define FCW_INTFLAG_BORERR_Msk                (_UINT32_(0x1) << FCW_INTFLAG_BORERR_Pos)            /* (FCW_INTFLAG) Brown Out Detect Error Flag Bit Mask */
#define FCW_INTFLAG_BORERR(value)             (FCW_INTFLAG_BORERR_Msk & (_UINT32_(value) << FCW_INTFLAG_BORERR_Pos)) /* Assigment of value for BORERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_WRERR_Pos                 _UINT32_(13)                                         /* (FCW_INTFLAG) Write Error Flag Bit Position */
#define FCW_INTFLAG_WRERR_Msk                 (_UINT32_(0x1) << FCW_INTFLAG_WRERR_Pos)             /* (FCW_INTFLAG) Write Error Flag Bit Mask */
#define FCW_INTFLAG_WRERR(value)              (FCW_INTFLAG_WRERR_Msk & (_UINT32_(value) << FCW_INTFLAG_WRERR_Pos)) /* Assigment of value for WRERR in the FCW_INTFLAG register */
#define FCW_INTFLAG_Msk                       _UINT32_(0x000031FF)                                 /* (FCW_INTFLAG) Register Mask  */


/* -------- FCW_STATUS : (FCW Offset: 0x18) (R/W 32) NVM Status Register -------- */
#define FCW_STATUS_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCW_STATUS) NVM Status Register  Reset Value */

#define FCW_STATUS_BUSY_Pos                   _UINT32_(0)                                          /* (FCW_STATUS) NVM Busy Status Position */
#define FCW_STATUS_BUSY_Msk                   (_UINT32_(0x1) << FCW_STATUS_BUSY_Pos)               /* (FCW_STATUS) NVM Busy Status Mask */
#define FCW_STATUS_BUSY(value)                (FCW_STATUS_BUSY_Msk & (_UINT32_(value) << FCW_STATUS_BUSY_Pos)) /* Assigment of value for BUSY in the FCW_STATUS register */
#define FCW_STATUS_HTDRDY_Pos                 _UINT32_(8)                                          /* (FCW_STATUS) High Temp Detect Ready Status Position */
#define FCW_STATUS_HTDRDY_Msk                 (_UINT32_(0x1) << FCW_STATUS_HTDRDY_Pos)             /* (FCW_STATUS) High Temp Detect Ready Status Mask */
#define FCW_STATUS_HTDRDY(value)              (FCW_STATUS_HTDRDY_Msk & (_UINT32_(value) << FCW_STATUS_HTDRDY_Pos)) /* Assigment of value for HTDRDY in the FCW_STATUS register */
#define FCW_STATUS_Msk                        _UINT32_(0x00000101)                                 /* (FCW_STATUS) Register Mask  */


/* -------- FCW_KEY : (FCW Offset: 0x1C) (R/W 32) SFR Unlock Register -------- */
#define FCW_KEY_RESETVALUE                    _UINT32_(0x00)                                       /*  (FCW_KEY) SFR Unlock Register  Reset Value */

#define FCW_KEY_KEYVALUE_Pos                  _UINT32_(0)                                          /* (FCW_KEY) NVM SFR Key Value Position */
#define FCW_KEY_KEYVALUE_Msk                  (_UINT32_(0xFF) << FCW_KEY_KEYVALUE_Pos)             /* (FCW_KEY) NVM SFR Key Value Mask */
#define FCW_KEY_KEYVALUE(value)               (FCW_KEY_KEYVALUE_Msk & (_UINT32_(value) << FCW_KEY_KEYVALUE_Pos)) /* Assigment of value for KEYVALUE in the FCW_KEY register */
#define FCW_KEY_KEYCODE_Pos                   _UINT32_(8)                                          /* (FCW_KEY) NVM SFR Key Code Position */
#define FCW_KEY_KEYCODE_Msk                   (_UINT32_(0xFFFFFF) << FCW_KEY_KEYCODE_Pos)          /* (FCW_KEY) NVM SFR Key Code Mask */
#define FCW_KEY_KEYCODE(value)                (FCW_KEY_KEYCODE_Msk & (_UINT32_(value) << FCW_KEY_KEYCODE_Pos)) /* Assigment of value for KEYCODE in the FCW_KEY register */
#define FCW_KEY_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (FCW_KEY) Register Mask  */


