Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/fcw.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief FCW register API structure */
typedef struct
{  /* Flash Write Control (FCW) */
  __IO  uint32_t                       FCW_CTRLA;          /**< Offset: 0x00 (R/W  32) NVM Write Control Register */
  __IO  uint32_t                       FCW_CTRLB;          /**< Offset: 0x04 (R/W  32) NVM Control B Register */
  __IO  uint32_t                       FCW_MUTEX;          /**< Offset: 0x08 (R/W  32) NVM MUTEX Register */
  __IO  uint32_t                       FCW_INTENCLR;       /**< Offset: 0x0C (R/W  32) NVM Interrupt Enable Clear Register */
  __IO  uint32_t                       FCW_INTENSET;       /**< Offset: 0x10 (R/W  32) NVM Interrupt Enable SET Register */
  __IO  uint32_t                       FCW_INTFLAG;        /**< Offset: 0x14 (R/W  32) NVM Interrupt Flag Register */
  __IO  uint32_t                       FCW_STATUS;         /**< Offset: 0x18 (R/W  32) NVM Status Register */
  __IO  uint32_t                       FCW_KEY;            /**< Offset: 0x1C (R/W  32) SFR Unlock Register */
  __IO  uint32_t                       FCW_ADDR;           /**< Offset: 0x20 (R/W  32) Flash Address Register */
  __IO  uint32_t                       FCW_SRCADDR;        /**< Offset: 0x24 (R/W  32) Source Data Address Register */
  __IO  uint32_t                       FCW_DATA[8];        /**< Offset: 0x28 (R/W  32) Flash Write Data Register */
  __IO  uint32_t                       FCW_SWAP;           /**< Offset: 0x48 (R/W  32) NVM Panel Swap Register */
  __IO  uint32_t                       FCW_PWP[8];         /**< Offset: 0x4C (R/W  32) PFM Write Protect Region 0 */
  __IO  uint32_t                       FCW_LBWP;           /**< Offset: 0x6C (R/W  32) Lower BFM Write Protect Register */
  __IO  uint32_t                       FCW_UBWP;           /**< Offset: 0x70 (R/W  32) Upper BFM Write Protect Register */
  __IO  uint32_t                       FCW_UOWP;           /**< Offset: 0x74 (R/W  32) User OTP Write Protect Register */
  __IO  uint32_t                       FCW_CWP;            /**< Offset: 0x78 (R/W  32) CFM Page Write Protect Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       FCW_HSMINTENCLR;    /**< Offset: 0x80 (R/W  32) HSM NVM Interrupt Enable Clear Register */
  __IO  uint32_t                       FCW_HSMINTENSET;    /**< Offset: 0x84 (R/W  32) HSM NVM Interrupt Enable SET Register */
  __IO  uint32_t                       FCW_HSMINTFLAG;     /**< Offset: 0x88 (R/W  32) HSM NVM Interrupt Flag Register */
  __IO  uint32_t                       FCW_HSMCWP;         /**< Offset: 0x8C (R/W  32) HSM CFG Write Protect Register */
  __IO  uint32_t                       FCW_HSMLDAT[8];     /**< Offset: 0x90 (R/W  32) HSM Tamper Lower Overwrite Data Register */
  __IO  uint32_t                       FCW_HSMUDAT[8];     /**< Offset: 0xB0 (R/W  32) HSM Tamper Upper Overwrite Data Register */
} fcw_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA91_FCW_COMPONENT_H_ */
